
const dic = {
  isSaleFlag:{'0':'在售','1':'停售'},
  earnType:{'1':'类固收','2':'权益类'},
  prodType:{'2':'季度丰','3':'地产基金','5':'安心盈','7':'其它','9':'现金管理','10':'二级市场','11':'量化对冲','12':'并购市场','13':'VC/PE','14':'海外市场','15':'债券市场','16':'另类创新','17':'地产基金','18':'FOF','19':'新三板市场'},
  prodType0:{'2':'季度丰','3':'地产基金','5':'安心盈','7':'其它','9':'现金管理'},
  prodType1:{'10':'二级市场','11':'量化对冲','12':'并购市场','13':'VC/PE','14':'海外市场','15':'债券市场','16':'另类创新','17':'地产基金','18':'FOF','19':'新三板市场'},
  prodType2:{'0':'A类','1':'B类','2':'C类'},
  customerFilter0:{'01':'个人客户','02':'机构客户'},
  customerFilter1:{'01':'男','02':'女'},
  customerFilter2:{'10':'普通会员','20':'白银会员','30':'象牙会员','40':'黄金会员','50':'铂金会员','60':'钻石会员'},
  customerFilter3:{'01':'正常','02':'潜在提交审批中','03':'会员转正审批中','04':'正式审批中','05':'会员修改审批中','06':'400分配客户中','07':'微信客户分配中'},
  customerLatent:{'01':'正常','02':'潜在提交审批中','06':'400分配客户中','07':'微信客户分配中'},
  customerMemBer:{'01':'正常','03':'会员转正审批中','05':'会员修改审批中',},
  customerOfficial:{'01':'正常','04':'正式审批中','05':'会员修改审批中',},
  customerFilter4:{'01':'正式会员','02':'潜在客户','03':'会员',},
  tradeSafeFilter1:{'01':'生效','02':'无效','03':'复效','04':'退保','05':'承保','06':'转让'},
  tradeSafeFilter2: {'1':'待总审','2':'总审通过','3':'总审退回'},
  fundInquire0:{'0':'认购','1':'申购','2':'撤单','3':'赎回'},
  fundInquire1:{'0':'未对账','1':'对账成功','2':'对账失败'},
  customerShare0:{'0':'个人客户','1':'机构客户',},
  // diviType:{'0':'现金分红','1':'红利再投',},
  shrType:{'0':'12个月','1':'18个月'},
  gender: {'01': '男','02': '女'},
  custSource: {'11': '理财师','02': '市场活动','03': '老客户转介绍','04': '媒体广告','05': '官网','06': '400 热线','07': '官微','08': '海银基金','09': '客户自助','12': '会员活动','13': '海银会', '10': 'V直播','01': '其他'},
  orgSource: {'04': '理财师','01': '市场活动','02': '会员活动','03': '媒体广告','05': '海银会','06': '海银基金','07': '400 热线','08': '官微','09': '官网','10': 'V直播','12': '其他'},
  'orgCertType': {'01':'营业执照','02':'组织机构代码证','03':'其他',},
  'certTypes': {'01':'身份证','02':'护照','03':'港澳台证件','05':'军官证','04':'其他'}, //值缺少
  'certTypes01':{'01':'身份证','05':'军官证'}, //无字段
  'certTypes02':{'02':'护照','03':'港澳台证件','04':'其他'},  //无字段
  nationality: {'01': '境内居民','02': '港澳人士','03': '台籍人士','04': '外籍人士'},
  isMerry: {'01': '未婚','02': '已婚','03': '其他'},
  isPrivary: {'01': '是','02': '否'},
  relation: {'01': '夫妻','02': '亲属','03': '朋友','04': '企业法人','05': '企业决策人','06': '企业财务','07': '企业主联系人','08': '企业客户','09': '企业关联方','10':'其他'},
  orgRelation:{'01':'母公司','02':'子公司','03':'兄弟公司','04':'企业法人','05':'企业主联系人','06':'企业决策人','07':'企业财务','08':'关联公司','09':'企业客户','10':'企业关联方','11':'亲属','12':'夫妻','13':'朋友','14':'其他'},
  institutionType: {'0': '国有','1': '私有'},
  licenseType: {'0': '营业执照','1': '工商执照'},
  isValid: {'0': '否','1': '是'},
  addiOrd: {'0': '否','1': '是'},
  moneyType:{'156':'人民币'},
  vocation: {'01':'私营企业','02':'高级白领','03':'自由职业','04':'退休','05':'其他','06':'公务员',},
  profession: {'01':'网络/信息服务/电子商务','02':'金融业','03':'房地产/建筑业','04':'法律','05':'媒体/公关/出版业','06':'批发/零售/贸易','07':'文化/体育/娱乐业','08':'制造业','09':'交通运输/仓储/物流业','10':'能源','11':'水利/环境','12':'酒店/旅游/餐饮',
  '13':'商业咨询','14':'卫生/社保/福利业','15':'政府机构/科研/培训','16':'其他'},
  companyType:{'01':'政府机关','02':'事业单位','03':'国营企业','04':'股份制企','05':'民营企业','06':'个体经营','07':'其它',},
  contactOrder:{'01':'手机优先','02':'家庭电话优先','03':'单位电话优先','05':'均可',},
  postAddress:{'1':'家庭地址','2':'单位地址'},
  mbrCertifyType:{'01':'客服人员回访','02':'自行拨打全国客服热线',},
  ctCertifyType:{'01':'客服人员回访','02':'自行拨打全国客服热线','03':'短信接收','04':'电子邮件接收'},
  importantReceive:{'01':'电邮接收','02':'寄送到家','03':'理财师转交',},
  sourceOfFunds:{'01':'薪金','02':'投资收入','03':'公司福利','04': '家族财产','05': '其他'},
  canInvestAsset: {'01':'50万以下','02':'50-100万','03':'100-300万','04': '300-500万','05': '500万以上'},
  orderType:{'01':'正常','02':'特批'},
  profCalcType:{'1':'固定收益','2':'固定+浮动收益','3':'浮动收益'},
  profRule:{'1':'默认','2':'按产品存续期限'},
  deadlineUnit:{'1':'月','2':'天'},
  riskLevel: {'01':'保守型','02':'稳健型','03':'进取型',},
  custsourceOfFunds: {'01':'薪金','02':'投资收入','03':'公司福利','04':'家族财产','05':'其他'},
  noPassReason: {'01':'无人接听','02':'空号','03':'无法接通','04':'关机','05':'客户否认填写会员表','06':' 非客户本人','07':'其他','08': '稍后回访'},
  busiClass: {'01':'国有','02':'合作','03':'合资','04':'独资','05':'集体','06': '私营'},
  budiPermit: {'01':'营业执照','02':'组织机构代码证','03':'其它',},
  instiRelative: {'01':'母公司','02':'子公司','03':'兄弟公司','04':'企业法人','05':'企业主联系人','06': '企业决策人','07': '企业财务'},
  payCurType: {'840':'美元','344':'港币','156': '人民币'},
  dealPayCurType: {'840':'美元','344':'港币','156': '人民币'},//交易记录（客户综合页面）
  tradeCertType: {'00':'身份证','01':'护照','02':'军官证','03':'士兵证','04':'港澳居民来往内地通行证','05': '户口本','06': '外国护照','07': '其他','08': '文职证','09': '警官证','0A': '台胞证',},
  transCertType: {'00':'身份证','01':'护照','02':'军官证','03':'士兵证','04':'港澳居民来往内地通行证','05': '户口本','06': '外国护照','07': '个人其它证件','08': '文职证','09': '警官证','0A': '台胞证','10': '组织机构代码证','11': '营业执照','12': '行政机关','13': '社会团体','14': '军队','15': '武警','16': '下属机构（具有主管单位批文号）','17': '基金会','18': '机构其他证件'},
  bankCertType: {'00':'身份证','01':'护照','02':'军官证','03':'士兵证','04':'港澳居民来往内地通行证','05': '户口本','06': '外国护照','07': '其他','08': '文职证','09': '警官证','0A': '台胞证','10': '组织机构代码证','11': '营业执照','12': '行政机关','13': '社会团体','14': '军队','15': '武警','16': '下属机构（具有主管单位批文号）','17': '基金会','18': '其它'},
  credentials:{'0':'身份证','1':'护照'},
  kpiType:{'1':'按期限','2':'按金额'},
  deadlineType:{'0':'单一期限','1':'多种期限'},
  incomeType:{'0':'单一收益','1':'多种收益'},
  riskLvl:{'1':'低','2':'较低','3':'中等','4':'较高','5':'高'},
  paymentType:{'1':'季度付息','2':'半年付息','3':'按年付息','4':'到期支付'},
  auditStat:{'0':'待提交审批','1':'待审批','2':'审批成功','3':'审批失败'},
  useStat:{'0':'待上架','1':'上架','2':'下架'},
  prodStat:{'1':'正常','2':'提前结束','3':'正常到期'},
  runStat:{'1':'预约中','2':'打款中','3':'打款结束','4':'产品成立','5':'正常结束','6':'提前终止','7':'延后结束'},
  operType:{'1':'封闭式','2':'开放式'},
  prodRiskLevel:{'1':'低','2':'较低','3':'中等','4':'较高','5':'高'},
  recStat: {'0':'停用','1':'启用','2':'停用'},
  tradeTime:{'0':'本月','1':'本季','2':'本年','3':'其他'},
  tradeType:{'0':'撤单','1':'申购','2':'赎回','3':'认购'},
  reviewState:{'0':'总审通过','1':'待总审','2':'待初审','3':'待提交','4':'已回访','5':'交易作废'},
  approveState:{'0':'待审核','1':'审核通过','2':'审核退回'},
  orderTypes:{'0':'特批','1':'正常'},
  tradCode:{'0020':'认购','0022':'申购','0024':'赎回','0033':'转让','0052':'撤单', '0036':'转换', '0059': '定投', '0098': '快赎' , '0071': '延期申请'},
  typeTradeCode:{'0020':'认购','0022':'申购','0024':'赎回','0033':'转让','0052':'撤单'},
  tradCode1:{'1001':'预约','1003':'更换卡号申请','1103':'更换卡号确认','0001':'开户申请','0101':'开户确认','0002':'销户申请','0102':'销户确认','0003':'修改客户资料申请',
            '0103':'客户资料变更确认','0008':'增加交易账户申请','0108':'增加交易账户确认','0120':'认购确认','0122':'申购确认','0124':'赎回确认','0133':'转让确认','0152':'撤单确认',
            '0020':'认购','0022':'申购','0024':'赎回','0033':'转让','0052':'撤单','0036':'基金转换','0143':'分红','0149':'募集失败','0150':'基金清盘','0151':'基金终止','0142':'强赎','0104':'基金账户冻结','0131':'基金份额冻结','0136':'基金转换','0136_IN':'基金转换(转入)','0136_OUT':'基金转换(转出)'},
  confStat:{'0':'待提交','1':'待初审','2':'待总审','3':'总审通过','4':'初审退回','5':'总审退回','6':'交易作废','7':'已回访','8':'财务审核通过','9':'财务审核退回','10':'待回访','11':'回访不通过','12':'待管理人审核','13':'管理人审核通过','14':'管理人审核不通过',},
  timeSlot:{'0':'1个月','1':'3个月','2':'6个月','3':'一年'},
  shrTypeId:{'0':'A类','1':'B类','2':'C类','3':'D类'},
  custName:{'0':'客户一','1':'客户二','2':'客户三','3':'客户四'},
  contractCode:{'0':'合同号一','1':'合同号二','2':'合同号三','3':'合同号四'},
  // matrType:{'1':'合同原件','2':'身份证复印件','3':'转账汇款单','4':'资产收入证明','5':'赎回申请单','6':'转让申请单','7':'退款申请单','8':'换卡申请表'},
  custType:{'0':'机构客户','1':'个人客户'},
  matrType:{'0':'附件资料','1':'交易资料','2':'证件资料','3':'转账汇款单','4':'资产收入证明','5':'赎回申请单','6':'转让申请单',
  '7':'撤单资料','8':'换卡申请表','9':'银行卡资料','a':'经办人资料','b':'退款申请单','c':'受让方经办人证件信息', 'g':'基金转换资料', 'j':'投资者信息', 'd': '风险揭示书(电子签约方式无需上传，纸质合同需上传)', 'l': '合同签署页资料', 'm': '证明资料(收入证明、资产证明、投资经历证明等)'},
  operCertType:{'00':'身份证','01':'护照','02':'军官证','03':'士兵证','04':'港澳居民来往内地通行证','05': '户口本','06': '外国护照','07': '其他','08': '文职证','09': '警官证','0A': '台胞证','10': '组织机构代码证','11': '营业执照','12': '行政机关','13': '社会团体','14': '军队','15': '武警','16': '下属机构（具有主管单位批文号）','17': '基金会','18': '其它'},
  certType:{'00':'身份证','01':'护照','02':'军官证','03':'士兵证','04':'港澳居民来往内地通行证','05': '户口本','06': '外国护照','07': '其他','08': '文职证','09': '警官证','0A': '台胞证'},//经办人
  diviType:{'0':'红利再投资','1':'现金分红'},
  hotSearchVal:{'A':'未来30天到期产品','B':'热销产品','C':'我销售过的产品'},
  deadline:{'1':'1年内','2':'1-2年','3':'2年以上'},
  onlineSign:{'0':'不支持','1':'支持'},
  inveType:{0:'提示1：你所预约的客户属于普通投资者，在购买产品前的风险警示环节需要进行双录。若该客户符合专业投资者标准，请发起相应转化申请。',
            2:'提示1：该投资者普通转专业申请正在审批流程中。'},
  inveNew:{1:'提示2：该客户已预约过新客专享产品，系统将限制只能其中一笔录单。',
    },
  addiOrdType:{1:'温馨提示：请关注该产品的起息日期，如不在同一批次到账则起息日不同，即无法与上一笔合并计息，请确认后提交。',
  },
  applyType:{'00':'申请中','01':'复核通过','02':'已放款','03':'已还款'},
  currType:{'156':'人民币','344':'港元','840':'美元'/*,'978':'欧元'*/},
  preProdType:{'1':'B类产品','2':'海外资产','3':'公募基金','4':'其他'},
  isControl:{'01':'是','02':'否'},
  isBenefitSelf:{'01':'是','02':'否'},
  prodClass:{'1':'类固收','2':'股权类','3':'证券类','4':'其他类','5':'现金管理',},
  secondClassFir:{'11':'地产产品','12':'融资租赁产品','13':'保理产品','14':'消费金融产品','15':'主动管理型产品','16':'其他类固收产品'}, //,'17':'其他类固收产品','18':'短期类固收产品'
  secondClassSec:{'21':'VC/PE产品','22':'地产股权产品','23':'并购产品','24':'股权FOF产品','25':'新三板产品'},
  secondClass3:{'31':'二级市场产品','32':'定向增发产品','33':'证券FOF产品','34':'量化对冲产品'},
  secondClass4:{'41':'影视产品','42':'其他创新型产品'},
  // secondClassSec:{'21':'二级市场产品','22':'定向增发产品','23':'证券FOF产品','24':'量化对冲产品','25':'证券夹层产品','26':'股票质押产品','27':'VC/PE产品','28':'地产股权产品','29':'并购产品','2A':'股权夹层产品','2B':'股权FOF产品','2C':'新三板产品','2D':'天使产品','2E':'其他创新型产品','2F':'影视产品'},
  secondClassThr:{'51':'日日盈','52':'月月盈'},
  // secondClassFou:{'51':'现金管理产品'},
  // secondClassFif:{'91':'其他创新型产品','92':'影视产品'},
  fundType: {
    '0': '普通', '1': '短债', '2': '货币', '3': 'ETF', '4': '保本', '5': 'QDII基金', '8': '专户产品',
    'A': '私募', 'E': '债券型', 'F': '指数型', 'G': 'LOF', 'B': '偏股型', 'C': '股债平衡型', 'D': '偏债型',
  },
  prodRiskLevel: {
    '3': '中等风险', '2': '较低风险', '1': '低风险', '5': '高风险', '4': '较高风险',
  },
  rejectTradeType: {
    '01': '基金转换', '02': '申购申请', '03': '认购申请', '04': '基金定投',
  },
  saleOrg: {
    '002': '海银财富', '001': '海银基金',
  },
  convertType: {
    '1004': '普通投资者转专业投资者', '1005': '专业投资者转普通投资者', '1007': '直接认定为专业投资者',
  },
  saleInstitution: {
    '01': '总审通过', '02': '待总审', '03': '待初审', '04': '总审退回', '05': '初审退回',
  },
  tradeCode: {
    '0020': '认购申请', '0022': '申购申请', '0036': '基金转换', '0059': '基金定投',
  },
  pubPriType: {'01': '私募', '02': '公募' },
  allSecondClass:{
    '11':'地产产品','12':'消费金融产品','13':'保理产品','14':'融资租赁产品','15':'主动管理型产品','16':'债券产品','17':'其他类固收产品','18':'短期类固收产品','21':'二级市场产品','22':'定向增发产品','23':'证券FOF产品','24':'量化对冲产品','25':'证券夹层产品','26':'股票质押产品','27':'VC/PE产品','28':'地产股权产品','29':'并购产品','2A':'股权夹层产品','2B':'股权FOF产品','2C':'新三板产品','2D':'天使产品','2E':'其他创新型产品','2F':'影视产品','51':'现金管理产品'
  },
  drawback: {
    '1':'冷静期退款','2':'无效资金退款','3':'仅撤单不退款','5':'其他退款'
  },
  transfertype:{
    '00':'非定制转让',
    '01':'定制转让'
  },
  transferDatas:[{label:'非定制转让', value:'00'}, {label:'定制转让', value:'01'}],
 confStat1:{'1':'待初审','2':'待总审','3':'总审通过','4':'初审退回','5':'总审退回'},
 confStat2:{'0':'待提交','1':'待初审','2':'待总审','3':'总审通过','4':'初审退回','5':'总审退回','6':'交易作废','7':'已回访','8':'财务审核通过','9':'财务审核退回','a':'待回访','b':'回访不通过'},
  signType:{'01':'纸质合同','02':'电子合同'},
  signFlag:{'0':'未签署','1':'已签署'},
 //new 资产证明格式
  certify: {
    '0': '中文', '1' : '英文', '2' : '中文 + 英文',
  },
  assetsStat: {
    '2':'待总审', '3':'总审通过', '5':'总审退回'
  },
  refundReson: {
    '0150': '基金清盘', '0143': '分红',
  },
  fetchDicList(flagName)
  {
    if(flagName == undefined) return {};
    return dic[flagName];
  },
  fetchDicValue(flagName,key)
  {
    if(flagName == undefined || key == undefined) return '';
    return dic[flagName][key];
  },
  transformData(data){
    if(!data){
      return [];
    }
    let transData = [];
    for(let prop in data){
      transData.push({
        label:data[prop],
        value:prop,
      });
    }

    return transData;
  }
};

function fetchDicList(flagName)
{
  if(flagName == undefined) return {};
  return dic[flagName];
}

function fetchDicValue(flagName,key)
{
  if(flagName == undefined || key == undefined) return '';
  return dic[flagName][key];
}

function transformData(data){
   if(!data){
       return [];
   }
   let transData = [];
   for(let prop in data){
       transData.push({
           label:data[prop],
           value:prop,
       });
   }

   return transData;
}
function fetchProClass(index){
  let arr = [];

}

export default dic;

export {fetchDicList,fetchDicValue,transformData}